---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Revolution
source: html/1f10fb69-ed46-3182-fe68-9c23f348e55c.htm
---
# Revolution Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.